loogg/HPM6750_Boot/libraries/hpm_sdk/soc/ip/hpm_adc16_regs.h
/*
 * CLOCK_DIVIDER (RW)
 *
 * clock_period, N half clock cycle per half adc cycle
 * 0 for same adc_clk and bus_clk, 1 for 1:2, 2 for 1:3.
 * set to 3 can genenerate 50MHz adc_clk at 200MHz bus_clk.
 */
#define ADC16_CONV_CFG1_CLOCK_DIVIDER_MASK (0xFU)
#define ADC16_CONV_CFG1_CLOCK_DIVIDER_SHIFT (0U)
#define ADC16_CONV_CFG1_CLOCK_DIVIDER_SET(x) (((uint32_t)(x) << ADC16_CONV_CFG1_CLOCK_DIVIDER_SHIFT) & ADC16_CONV_CFG1_CLOCK_DIVIDER_MASK)
#define ADC16_CONV_CFG1_CLOCK_DIVIDER_GET(x) (((uint32_t)(x) & ADC16_CONV_CFG1_CLOCK_DIVIDER_MASK) >> ADC16_CONV_CFG1_CLOCK_DIVIDER_SHIFT)

/* Bitfield definition for register: ADC_CFG0 */
/*
 * SEL_SYNC_AHB (RW)
 *
 * set to 1 will enable sync AHB bus, to get better bus performance.
 * Adc_clk must to be set to same as bus clock at this mode
 */
#define ADC16_ADC_CFG0_SEL_SYNC_AHB_MASK (0x80000000UL)
#define ADC16_ADC_CFG0_SEL_SYNC_AHB_SHIFT (31U)
#define ADC16_ADC_CFG0_SEL_SYNC_AHB_SET(x) (((uint32_t)(x) << ADC16_ADC_CFG0_SEL_SYNC_AHB_SHIFT) & ADC16_ADC_CFG0_SEL_SYNC_AHB_MASK)
#define ADC16_ADC_CFG0_SEL_SYNC_AHB_GET(x) (((uint32_t)(x) & ADC16_ADC_CFG0_SEL_SYNC_AHB_MASK) >> ADC16_ADC_CFG0_SEL_SYNC_AHB_SHIFT)

/*
 * ADC_AHB_EN (RW)
 *
 * set to 1 to enable ADC DMA to write data to soc memory bus, for trig queue and seq queue;
 */
#define ADC16_ADC_CFG0_ADC_AHB_EN_MASK (0x20000000UL)
#define ADC16_ADC_CFG0_ADC_AHB_EN_SHIFT (29U)
#define ADC16_ADC_CFG0_ADC_AHB_EN_SET(x) (((uint32_t)(x) << ADC16_ADC_CFG0_ADC_AHB_EN_SHIFT) & ADC16_ADC_CFG0_ADC_AHB_EN_MASK)
#define ADC16_ADC_CFG0_ADC_AHB_EN_GET(x) (((uint32_t)(x) & ADC16_ADC_CFG0_ADC_AHB_EN_MASK) >> ADC16_ADC_CFG0_ADC_AHB_EN_SHIFT)

/*
 * CONVERT_DURATION (RW)
 *
 * for trigger queue, from trg_sample_req to trg_convert_req
 */
#define ADC16_ADC_CFG0_CONVERT_DURATION_MASK (0xFFFF000UL)
#define ADC16_ADC_CFG0_CONVERT_DURATION_SHIFT (12U)
#define ADC16_ADC_CFG0_CONVERT_DURATION_SET(x) (((uint32_t)(x) << ADC16_ADC_CFG0_CONVERT_DURATION_SHIFT) & ADC16_ADC_CFG0_CONVERT_DURATION_MASK)
#define ADC16_ADC_CFG0_CONVERT_DURATION_GET(x) (((uint32_t)(x) & ADC16_ADC_CFG0_CONVERT_DURATION_MASK) >> ADC16_ADC_CFG0_CONVERT_DURATION_SHIFT)

/*
 * PORT3_REALTIME (RW)
 *
 * set to enable trg queue stop other queues
 */
#define ADC16_ADC_CFG0_PORT3_REALTIME_MASK (0x1U)
#define ADC16_ADC_CFG0_PORT3_REALTIME_SHIFT (0U)
#define ADC16_ADC_CFG0_PORT3_REALTIME_SET(x) (((uint32_t)(x) << ADC16_ADC_CFG0_PORT3_REALTIME_SHIFT) & ADC16_ADC_CFG0_PORT3_REALTIME_MASK)
#define ADC16_ADC_CFG0_PORT3_REALTIME_GET(x) (((uint32_t)(x) & ADC16_ADC_CFG0_PORT3_REALTIME_MASK) >> ADC16_ADC_CFG0_PORT3_REALTIME_SHIFT)

/* Bitfield definition for register: INT_STS */
/*
 * TRIG_CMPT (W1C)
 *
 * interrupt for one trigger conversion complete if enabled
 */
#define ADC16_INT_STS_TRIG_CMPT_MASK (0x80000000UL)
#define ADC16_INT_STS_TRIG_CMPT_SHIFT (31U)
#define ADC16_INT_STS_TRIG_CMPT_SET(x) (((uint32_t)(x) << ADC16_INT_STS_TRIG_CMPT_SHIFT) & ADC16_INT_STS_TRIG_CMPT_MASK)
#define ADC16_INT_STS_TRIG_CMPT_GET(x) (((uint32_t)(x) & ADC16_INT_STS_TRIG_CMPT_MASK) >> ADC16_INT_STS_TRIG_CMPT_SHIFT)

/*
 * TRIG_SW_CFLCT (W1C)
 *
 */
#define ADC16_INT_STS_TRIG_SW_CFLCT_MASK (0x40000000UL)
#define ADC16_INT_STS_TRIG_SW_CFLCT_SHIFT (30U)
#define ADC16_INT_STS_TRIG_SW_CFLCT_SET(x) (((uint32_t)(x) << ADC16_INT_STS_TRIG_SW_CFLCT_SHIFT) & ADC16_INT_STS_TRIG_SW_CFLCT_MASK)
#define ADC16_INT_STS_TRIG_SW_CFLCT_GET(x) (((uint32_t)(x) & ADC16_INT_STS_TRIG_SW_CFLCT_MASK) >> ADC16_INT_STS_TRIG_SW_CFLCT_SHIFT)

/*
 * TRIG_HW_CFLCT (RW)
 *
 */
#define ADC16_INT_STS_TRIG_HW_CFLCT_MASK (0x20000000UL)
#define ADC16_INT_STS_TRIG_HW_CFLCT_SHIFT (29U)
#define ADC16_INT_STS_TRIG_HW_CFLCT_SET(x) (((uint32_t)(x) << ADC16_INT_STS_TRIG_HW_CFLCT_SHIFT) & ADC16_INT_STS_TRIG_HW_CFLCT_MASK)
#define ADC16_INT_STS_TRIG_HW_CFLCT_GET(x) (((uint32_t)(x) & ADC16_INT_STS_TRIG_HW_CFLCT_MASK) >> ADC16_INT_STS_TRIG_HW_CFLCT_SHIFT)

/*
 * READ_CFLCT (W1C)
 *
 * read conflict interrup, set if wait_dis is set, one conversion is in progress, SW read another channel
 */
#define ADC16_INT_STS_READ_CFLCT_MASK (0x10000000UL)
#define ADC16_INT_STS_READ_CFLCT_SHIFT (28U)
#define ADC16_INT_STS_READ_CFLCT_SET(x) (((uint32_t)(x) << ADC16_INT_STS_READ_CFLCT_SHIFT) & ADC16_INT_STS_READ_CFLCT_MASK)
#define ADC16_INT_STS_READ_CFLCT_GET(x) (((uint32_t)(x) & ADC16_INT_STS_READ_CFLCT_MASK) >> ADC16_INT_STS_READ_CFLCT_SHIFT)

/*
 * SEQ_SW_CFLCT (W1C)
 *
 * sequence queue conflict interrup, set if HW or SW trigger received during conversion
 */
#define ADC16_INT_STS_SEQ_SW_CFLCT_MASK (0x8000000UL)
#define ADC16_INT_STS_SEQ_SW_CFLCT_SHIFT (27U)
#define ADC16_INT_STS_SEQ_SW_CFLCT_SET(x) (((uint32_t)(x) << ADC16_INT_STS_SEQ_SW_CFLCT_SHIFT) & ADC16_INT_STS_SEQ_SW_CFLCT_MASK)
#define ADC16_INT_STS_SEQ_SW_CFLCT_GET(x) (((uint32_t)(x) & ADC16_INT_STS_SEQ_SW_CFLCT_MASK) >> ADC16_INT_STS_SEQ_SW_CFLCT_SHIFT)

/*
 * SEQ_HW_CFLCT (RW)
 *
 */
#define ADC16_INT_STS_SEQ_HW_CFLCT_MASK (0x4000000UL)
#define ADC16_INT_STS_SEQ_HW_CFLCT_SHIFT (26U)
#define ADC16_INT_STS_SEQ_HW_CFLCT_SET(x) (((uint32_t)(x) << ADC16_INT_STS_SEQ_HW_CFLCT_SHIFT) & ADC16_INT_STS_SEQ_HW_CFLCT_MASK)
#define ADC16_INT_STS_SEQ_HW_CFLCT_GET(x) (((uint32_t)(x) & ADC16_INT_STS_SEQ_HW_CFLCT_MASK) >> ADC16_INT_STS_SEQ_HW_CFLCT_SHIFT)

/*
 * SEQ_DMAABT (W1C)
 *
 * dma abort interrupt, set if seqence dma write pointer reachs sw read pointer if stop_en is set
 */
#define ADC16_INT_STS_SEQ_DMAABT_MASK (0x2000000UL)
#define ADC16_INT_STS_SEQ_DMAABT_SHIFT (25U)
#define ADC16_INT_STS_SEQ_DMAABT_SET(x) (((uint32_t)(x) << ADC16_INT_STS_SEQ_DMAABT_SHIFT) & ADC16_INT_STS_SEQ_DMAABT_MASK)
#define ADC16_INT_STS_SEQ_DMAABT_GET(x) (((uint32_t)(x) & ADC16_INT_STS_SEQ_DMAABT_MASK) >> ADC16_INT_STS_SEQ_DMAABT_SHIFT)

/*
 * SEQ_CMPT (W1C)
 *
 * the whole sequence complete interrupt
 */
#define ADC16_INT_STS_SEQ_CMPT_MASK (0x1000000UL)
#define ADC16_INT_STS_SEQ_CMPT_SHIFT (24U)
#define ADC16_INT_STS_SEQ_CMPT_SET(x) (((uint32_t)(x) << ADC16_INT_STS_SEQ_CMPT_SHIFT) & ADC16_INT_STS_SEQ_CMPT_MASK)
#define ADC16_INT_STS_SEQ_CMPT_GET(x) (((uint32_t)(x) & ADC16_INT_STS_SEQ_CMPT_MASK) >> ADC16_INT_STS_SEQ_CMPT_SHIFT)

